tidyrのspreadを、pandasで実行する

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic/train.csv")

In [9]:
df2 = df.groupby(["Sex", "Embarked"]).size().reset_index(name="count")

In [10]:
df2

      Sex Embarked  count
0  female        C     73
1  female        Q     36
2  female        S    203
3    male        C     95
4    male        Q     41
5    male        S    441

===== ここまでデータ準備 =====

In [13]:
df2.pivot(index="Embarked", columns="Sex", values="count")

Sex       female  male
Embarked
C             73    95
Q             36    41
S            203   441

In [15]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)